app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
			<div class="form-group">
				<%= f.label :category %> <%= f.select :category, options_for_select(@options_array), {}, {class: "form-control"} %>