app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC
---
  def index
  	@articles = Article.all.order(updated_at: :desc)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "text", "author", "visible", "created_at", "updated_at", "summary") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdf"], ["text", "asdf"], ["author", "asdf"], ["visible", true], ["created_at", 2016-12-07 22:42:16 UTC], ["updated_at", 2016-12-07 22:42:16 UTC], ["summary", ""]]
---
  def create

  	article = Article.new(article_params)
    article.category = Category.find(params[:article][:category])

  	if article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "category_id" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["category_id", 8], ["updated_at", 2016-12-24 15:59:25 UTC], ["id", 21]]
---
  def update

    article = Article.find(params[:id])
    article.category = Category.find(params[:article][:category])

  	if article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 12]]
---
  def destroy

    article = Article.find(params[:id])

  	if article.destroy