app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."category_id" = $1 LIMIT $2  [["category_id", 4], ["LIMIT", 1]]
---
  def show
  	@category = Category.find(params[:id])
  	@articles = Article.where(category_id: params[:id])

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "fo shizzle"], ["created_at", 2016-12-24 15:31:11 UTC], ["updated_at", 2016-12-24 15:31:11 UTC]]
---
  def create
    category = Category.new(category_params)

    if category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "categories" SET "title" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["title", "Mountain cycling"], ["updated_at", 2016-12-24 15:16:58 UTC], ["id", 6]]
---
  def update

    category = Category.find(params[:id])

    if category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 7]]
---
  def destroy

    category = Category.find(params[:id])

    if category.destroy